text_licence = """ 
<html><body>  <style type="text/css">
    div { 
    width: 800px; 
    margin: 0 auto;
    text-align: left;
    width: 800px;
   }
   body {
    margin: 0;
    padding: 0;
    text-align: center; 
   }
   
  </style> 
  
  <div width="500"><p>
 <h1 align="center">Лицензионное Соглашение на использование мобильного приложения Directory</h1>


&emsp;Собственники проекта «Directory» (далее Правообладатель) также являются собственниками Приложения «Directory» (далее – Приложение) и документации, имеющей отношение к Приложению. 
Любые права на интеллектуальную собственность, касающиеся Приложения, принадлежат единолично Правообладателю.
<br><br>&emsp;Данное Лицензионное Соглашение (далее – Соглашение) не может рассматриваться как отказ Правообладателя от своих прав на интеллектуальную собственность, в какой бы то ни было юрисдикции.
<br><br>&emsp;Соглашение устанавливает требования, условия и правила использования любым лицом (далее – Пользователь) Приложения и его возможностей.

<h2 align="center">Пользователь должен принять условия Соглашения или не использовать Приложения.</h2>
&emsp;Любое использование Приложения означает полное и безоговорочное принятие Вами условий, требований, правил настоящего Соглашения. 
Копируя Приложение, устанавливая его на свое мобильное устройство, планшет или компьютер и используя Приложение любым образом, Пользователь выражает свое полное и безусловное согласие со всеми требованиями, правилами и условиями Соглашения. 
Использование Приложения допустимо исключительно на условиях настоящего Соглашения.
<br><br>&emsp;Если Пользователь не принимает условия, требования, правила Соглашения в полном объёме, не имеет намерения их соблюдать, тогда Пользователь не имеет права использовать Приложение в каких-либо целях. Использование Приложения с нарушением или невыполнением какого-либо из условий, требований, правил Соглашения запрещено. Пользователь должен немедленно удалить Приложение или любой его компонент с мобильного устройства, планшета и компьютера. Иначе Пользователь считается безусловно согласным с требованиями, правилами, условиями Соглашения.

<h2 align="center">Условия получения Пользователем некоммерческой лицензии</h2>

&emsp;Правообладатель предоставляет Пользователю, а Пользователь принимает ограниченную некоммерческую персональную неисключительную лицензию без права передачи и сублицензирования на использование Приложения в мобильном телефоне, планшете или на компьютере, которым Пользователь владеет или распоряжается. 
Данная лицензия передается исключительно на условиях, изложенных в тексте данного Соглашения. 
Правообладатель может аннулировать лицензию в любое время, не объясняя причин. Также нарушение Пользователем требований, условий, правил данного Соглашения автоматически ведет к аннулированию лицензии и Соглашения. 
По окончанию срока действия Соглашения, лицензия предоставленная по нему является недействительной, вследствие чего Пользователь должен прекратить пользоваться Приложением.
<br><br>&emsp;Правообладатель оставляет за собой все права, которые могут быть прямо и непрямо выражены в этом Соглашении. 
Без письменного согласия Правообладателя Пользователь не имеет права воспроизводить и распространять Приложение или его части в коммерческих целях.
<br><br>&emsp;Пользователь не имеет права без предварительного письменного соглашения Правообладателя:
<ul style="list-style-type:disc">
    <li>Модифицировать любым образом и интегрировать в другое программное обеспечение, создавать переработанную версию любой части Приложения;</li>
    <li>Копировать и распространять Приложение в интересах третьих лиц;</li>
    <li>Декомпилировать, перерабатывать Приложение, пытаться получить исходный код Приложения.</li>
</ul>

<h2 align="center">Соглашение распространяется на новые версии Приложения</h2>
&emsp;Правообладатель в соответствии с данным Соглашением не обязан предоставлять поддержку, обслуживание, обновления, модификации и новые версии Приложения. 
В случае выпуска обновления для Приложения, новая версия устанавливается на мобильном устройстве, планшете или компьютере автоматически путем электронной коммуникации.
<br><br>&emsp;Действие настоящей Соглашения распространяется на все обновления и новые версии Приложения. Соглашаясь с установкой обновления или новой версии Приложения, 
Пользователь принимает условия настоящей Соглашения для соответствующих обновлений и новых версий Приложения, если обновление и установка новой версии Приложение не сопровождается иным Соглашением.

<h2 align="center">Ответственность за безошибочную работу Приложения</h2>
&emsp;Приложение предоставляется без каких-либо гарантий, прямо выраженных или подразумеваемых в отношении безошибочной и бесперебойной работы Приложения или отдельных её компонентов и функций. 
Правообладатель не гарантирует, что Приложение будет соответствовать требованиям Пользователя.
<br><br>&emsp;Правообладатель не гарантирует достоверность, точность, полноту и своевременность данных, а также не предоставляет никаких иных гарантий, прямо не указанных в настоящем Соглашения.
<br><br>&emsp;Правообладатель не несет ответственности за точность, полноту, применимость или надежность результатов, полученных в ходе использования Приложения или каких-либо данных и информации, загруженной либо иным способом полученной посредством использования Приложения.
<br><br>&emsp;Пользователь принимает на себя на собственный риск и по своему усмотрению ответственность за получаемую любым способом информацию через Приложение.

<h2 align="center">Правообладатель не несет ответственности за ущерб</h2>
&emsp;Правообладатель не несет ответственности в любом случае перед Пользователем или третьими лицами за какие-либо прямые или косвенные последствия, в том числе за ущерб или убытки в отношении деловой репутации, неполученной прибыли, утраченных или поврежденных данных в результате использования, неиспользования или невозможности использования Приложения или отдельных её компонентов.
<br><br>&emsp;К Правообладателю не могут быть предъявлены претензии относительно ущерба, полученного Пользователем или в отношении его собственности.
<br><br>&emsp;Если Правообладатель в соответствии с действующим законодательством будет признан ответственным за ущерб или убытки, сумма компенсации не будет превышать эквивалент пятидесяти долларов США.
<br><br>&emsp;Пользователь берет обязательства не нарушать права, освобождать от ответственности, гарантировать непричинение ущерба Правообладателю в связи с любыми претензиями, ущербом, убытками и любыми расходами, возникшими вследствие нарушения требований, условий, правил этого Соглашения.
<br><br>&emsp;Соглашение регулируется и толкуется в соответствии с законодательством Украины. Вопросы, неурегулированные настоящим Соглашением, подлежат разрешению в соответствии с действующим законодательством Украины.

<h2 align="center">Требования к Пользователю</h2>
&emsp;Используя Приложение, Пользователь тем самым подтверждает, что являетесь законным владельцем мобильного телефона, планшета или компьютера, на которых установлено Приложение, а также является надлежаще зарегистрированным и законным пользователем услуг подвижной радиотелефонной связи или телематических услуг, позволяющих передавать данные для использования Приложения.
<br><br>&emsp;Пользователь безусловно соглашается на получение сервисных push и sms-сообщений, необходимых для функционирования Приложения.
<br><br>&emsp;Правообладатель вправе путем направления сообщений на мобильный телефон, планшет и компьютер, в том числе с использованием сети связи, информировать Пользователя:
<ul style="list-style-type:disc">
<li>о порядке использования Приложения,</li>
<li>о проводимых рекламных и иных мероприятиях,</li>
<li>об условиях потребления услуг третьих лиц с использованием Приложения.</li>
</ul>
&emsp;Принятие Пользователем условий настоящего Соглашения означает безусловное согласие с указанным правом Правообладателя и получением указанных сообщений.

<h2 align="center">Использование персональных данных</h2>
&emsp;Пользователь настоящим уведомлен, понимает и соглашается с тем, что Приложение может собирать обезличенные (без привязки к персональным данным Пользователя) статистические данные об использовании Приложения в автоматическом режиме передавать их Правообладателю.
<br><br>&emsp;Пользователь дает Правообладателю согласие на обработку персональных данных Пользователя Правообладателем, на передачу Правообладателем персональных данных Пользователя партнерам Правообладателя, а также на обработку персональных данных партнерам Правообладателя исключительно для целей оказания Пользователю услуг.
<br><br>&emsp;Приложением используются следующие персональные данные о Пользователе:

<p>
 <b style="padding-left: 1em;">1. Номер телефона или e-mail.</b> Используется для подтверждения контактных данных Пользователя для последующей коммуникации посредством SMS и телефонных звонков. Введённый номер телефона не обязательно должен соответствовать номеру устройства, на котором установлено Приложение. Приложение может использоваться с полной функциональностью на устройствах без SIM-карты, при условии, что Пользователем введён номер, для которого Пользователь знает или может получить код подтверждения посредством SMS. Номер телефона пользователя не передаётся третьим лицам за исключением ситуаций, когда успешное выполнение заказа невозможно без прямой связи между перевозчиком и пользователем.
</p>

<p>
<b style="padding-left: 1em;">2. Физическое местоположение устройства.</b> Информация не хранится и не передаётся третьим лицам. Используется для обеспечения персонализированного сервиса адекватного Пользователю. Информация о предполагаемом физическом местоположении устройства определяется путём сбора данных о близлежащих базовых станциях мобильной связи и точках доступа WiFi, либо при помощи данных, полученных от GPS-приёмника устройства. Пользователь в любой момент может отказаться от отправки информации о физическом местоположении устройства на сервер, отключив определение местоположения в мобильном устройстве или планшете.
</p>

<p>
<b style="padding-left: 1em;">3. История использования Приложения Пользователем.</b> Информация хранится, но не передаётся третьим лицам. Используется для обеспечения персонализированного сервиса адекватного Пользователю. По этой хранимой Приложением информации невозможно определить даты и точные маршруты предыдущих поездок Пользователя, что обеспечивает необходимую безопасность личных данных.
</p>
&emsp;Настоящее Соглашение может изменяться Правообладателем в одностороннем порядке. Указанные изменения в Соглашении вступают в силу с даты их публикации, если иное не оговорено в соответствующей публикации.
</p></div></body></html>
"""